<style>
  body {
    margin: 0 auto;
  }
  .modal-dialog {
    max-width: 1000px;
  }
  .modal-title {
    font-size: 26px;
    color: #707070;
    font-weight: bold;
  }
  .first-sec, .second-sec {
    color: #707070;
    font-size: 18px;
    letter-spacing: 3px;
    line-height: 36px;
  }
  .bold-title {
    font-size: 20px;
    color: #707070;
    font-weight: bold;
  }
  .modal-content {
    padding: 30px;
  }

  @media screen and (max-width:375px) {
    .modal-title {
      font-size: 20px;
    }
    .first-sec, .second-sec {
      font-size: 14px;
      letter-spacing: 3px;
      line-height: 24px;
    }
    .modal-content {
      padding: 15px;
    }
    .bold-title {
      font-size: 18px;
    }
  }
</style>

<div class="modal fade" id="staticBackdrop" data-backdrop="static" data-keyboard="false" tabindex="-1" aria-labelledby="staticBackdropLabel" aria-hidden="true">
  <div class="modal-dialog">
    <div class="modal-content">
      <div class="modal-header">
        <h5 class="modal-title" id="staticBackdropLabel">網站約定條款</h5>
        <button type="button" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body">
        <div class="first-sec">
        　　　歡迎您在「斑斕」購物網站進行消費（下稱本公司）。請您於使用服務前先詳細閱讀以下約定條款。
          <br><br>
          　　本約定條款的目的，是為了保護本公司以及您的利益，如果您點選「我同意」或類似語意的選項、或在本公司進行訂購、付款、消費或進行相關行為，就視為您事先已經知悉、並同意本約定條款的所有約定。<br>
          <br>
          　　本公司有權於任何時間基於需要而修訂或變更本同意書內容，除對會員個人權益有重大影響者，本公司將不會個別通知會員。若您於任何修改或變更之後繼續使用本服務時，將視為您已閱讀、瞭解並同意接受已完成的相關修改與變更，並以您同意接受的相關修改與變更作為雙方的契約更新內容。若您不同意上述的本同意書修訂或更新方式，或不接受本同意書的其他任一約定，您應立即停止使用本服務。<br>
          <br>
          　　若您尚未滿二十歲，您所為的法律行為應得法定代理人的同意。在此必須請您的父、母或監護人詳閱本同意書並同意後，您才可以使用本網站提供的服務。日後當您於滿二十歲之前使用本網站服務的一切行為，您必須對本公司擔保您已經取得法定代理人必要的同意。<br>
          <br>
          <br>
          <br>
        </div>
        <!-- 第二段分隔線 -->
        <div class="second-sec">
          <div class="bold-title">會員服務範圍</div><br>
          　　本公司網站所提供的服務範圍，包括所有網站以及未來所有可能新增的本公司網站，且包括使用本公司所提供金流、物流與資訊流平台等網路或實體
          通路的一切服務內容，包括但不限於商品買賣、內容瀏覽、利用電子郵件、實體郵件、電話或其他方式進行商品行銷資訊之提供及其他服務。本公司得
          視業務需要及實際情形，增減、變更或終止相關服務的項目或內容，且無需個別通知您。以上各網站商品交易頁面呈現之商品名稱、價格、內容、
          規格、型號及其他相關資訊，均為雙方契約的一部分。<br>
          <br>
          <br>
          <div class="bold-title">會員隱私權保障</div><br>
          　　本公司遵守個人資料保護相關法令的規定，關於於您所登錄或留存的個人資料及其他特定資訊（例如交易資料例如交易資料）之蒐集、處理及利用，
          謹依個人資料保護法第8條規定告知以下事項：<br>
          <br>
          <br>
          1.本公司之蒐集目的在於進行客戶管理、會員管理及行銷與內部的統計調查與分析（法定特定目的項目編號為 037, 066, 022, 060）。蒐集方式將透過加
          入會員或訂購單填寫方式進行個人資料之蒐集。<br>
          2.蒐集之個人資料類別本公司於網站內蒐集的個人資料包括：<br>
          　　-C001辨識個人者：如消費者之姓名、地址、電話、電子郵件等資訊。<br>
          　　-C002辨識財務者：如信用卡或轉帳帳戶資訊。<br>
          　　-C003政府資料中之辨識者：如身分證字號或護照號碼（非台灣國籍者）。<br>
          　　-C011個人描述：如性別、國籍、出生年月日。<br>
          3.利用期間、地區、對象及方式<br>
          　　期間：本公司營運期間。<br>
          　　地區：消費者之個人資料將用於台灣地區。<br>
          　　利用對象及方式：消費者之個人資料蒐集除用於本公司之會員管理、客戶管理之檢索查詢等功能外，將有以下利用：<br>
          　　　-物品寄送：於交寄相關商品時，將消費者個人資料利用於交付給相關物流、郵寄廠商用於物品寄送之目的。<br>
          　　　-金融交易及授權：消費者所提供之財務相關資訊，將於金融交易過程（如信用卡授權、轉帳）時提交給金融機構以完成金融交易。<br>
          　　　-行銷：本公司將利用消費者之地址及郵件、電話號碼進行本公司或合作廠商商品之宣傳行銷。<br>
          　　　-消費者個人資料之權利消費者交付本公司個人資料者，依個資法得行使以下權利：查詢或請求閱覽。 請求製給複製本。 請求補充或更正。 請求停止蒐集、處理或利用。 請求刪除。<br>
          <br>
          <br>
          <div class="bold-title">安全付款機制</div><br>
          信用卡線上刷卡：本公司採用與國內金融機構相同等級的「SSL 128 Bit 安全加密機制保障」，並完成ISMS（Information Security Management System資訊安全管理系統）建置；以及ISO27001管理制度通過。透過網路使用線上刷卡，您的個人及信用卡資料均可獲得安全措施的維護。<br>
          <br>
          <br>
          <div class="bold-title">交易確認及保護</div><br>
          您得依據本服務所提供的確認商品數量及價格機制進行下單。本公司對您的下單內容，除於下單後二工作日內附正當理由為拒絕或有其他法定事由外，為接受下單。但您已付款者，除法律另有規定外，視為交易成立。<br>
          本服務於必要時，得就特定商品訂定個別消費者每次訂購的數量上限。逾越該數量上限進行下單時，本服務僅依該數量上限出貨。<br>
          本服務提供商品交付的地點及方式供您選擇，並依您的擇定交付。<br>
          您得依消費者保護法第十九條第一項行使相關權利。<br>
          <br>
          <br>
          <div class="bold-title">智慧財產權</div><br>
          本服務所使用的軟體或程式、網站上所有內容，包括但不限於著作、圖片、檔案、資訊、資料、網站架構、網站畫面的安排、網頁設計，除本公司有特別明
          示外，皆由本公司或其他權利人依法擁有其智慧財產權，包括但不限於商標權、專利權、著作權、營業秘密與專有技術等。<br>
          任何人不得擅自使用、修改、重製、公開播送、改作、散布、發行、公開發表、進行還原工程、解編或反向組譯。任何人欲引用或轉載前述軟體、程式或網站
          內容，必須依法取得本公司或其他權利人的事前書面同意。<br>
          <br>
          <br>
          <div class="bold-title">服務中止及免責聲明</div><br>
          本公司確保以符合目前一般可合理期待安全性之方式及技術，維護本網站的正常運作。但在下列情況之下，本公司將有權暫停、中斷或拒絕提供本服務<br>
          的全部或一部，且不負事先通知您的義務，本公司對使用者任何直接或間接的損害，均不負任何賠償或補償的義務：<br>
          　　1.對本服務相關軟硬體設備進行搬遷、更換、升級、保養或維修時；<br>
          　　2.使用者有任何違反政府法令或本同意書的情形；<br>
          　　3.天災或其他不可抗力因素所導致的服務停止或中斷；<br>
          　　4.其他不可歸責於本公司事由所致的服務停止或中斷；<br>
          　　5.非本公司所得控制的事由而致本服務資訊顯示不正確、或遭偽造、竄改、刪除或擷取、或致系統中斷或不能正常運作時。<br>
          　　6.使用本公司簡訊傳輸服務時，出現誹謗、攻擊或傷害性文字，或其他違背公序良俗的內容，本公司有權拒絕您使用本服務。<br>
          　　7.其他本公司認為有需要停止或中斷服務的情形。<br>
          　　8.本公司針對可預知的軟硬體維護計畫，有可能導致系統中斷或是暫停時，將盡可能地於該狀況發生前，以適當方式於本網站公告。<br>
          　　9.本網站僅是依提供服務當時的既有項目、功能及現狀提供您使用，本公司並不負任何的擔保、保證或損害賠償責任。<br>
        </div>


      </div>

    </div>
  </div>
</div>