-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2020-08-18 10:13:48
-- 伺服器版本： 10.4.13-MariaDB
-- PHP 版本： 7.3.19

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `mm58`
--

-- --------------------------------------------------------

--
-- 資料表結構 `categories`
--

CREATE TABLE `categories` (
  `sid` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `parent_sid` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `categories`
--

INSERT INTO `categories` (`sid`, `name`, `parent_sid`) VALUES
(1, '頭花、捧花', 0),
(2, '禮盒花', 0),
(3, '花束', 0),
(4, '乾燥花', 0);

-- --------------------------------------------------------

--
-- 資料表結構 `course`
--

CREATE TABLE `course` (
  `sid` int(11) NOT NULL,
  `course_name` varchar(255) CHARACTER SET utf8 NOT NULL,
  `course_price` int(11) NOT NULL,
  `course_date` varchar(255) NOT NULL,
  `content` varchar(255) CHARACTER SET utf8 NOT NULL,
  `img_01` varchar(255) CHARACTER SET utf8 NOT NULL,
  `end_time` varchar(255) CHARACTER SET utf8 NOT NULL,
  `size` varchar(255) CHARACTER SET utf8 NOT NULL,
  `intro` varchar(255) CHARACTER SET utf8 NOT NULL,
  `course_time` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `course`
--

INSERT INTO `course` (`sid`, `course_name`, `course_price`, `course_date`, `content`, `img_01`, `end_time`, `size`, `intro`, `course_time`) VALUES
(1, '捧花主題課程｜《銀白浪漫》', 1800, '2020/8/11-8/17', '夜半 我的世界下起了一場雪 <br>\r\n被銀白給覆蓋 可你正在那 <br>\r\n曾與我約定的樹下 不畏這銀白了你的所有顏色 <br>\r\n笑著跟我說 聖誕快樂 <br>\r\n', 'silver', '8/07(五)23:59', '花面寬約10x15x10cm', '乾燥花正夯！在網美當道的世代，拍照或是家裡沒有放上一束美美的乾燥花束，可就少了點夢幻的氣味，一人就可以上課的乾燥花課程，獨特的造型深富美感與設計，無論是送禮或是在家內裝飾，都是獨一無二的花束！', '19:30~21:30PM'),
(2, '花瓶主題課程｜《猖狂之紅》', 2500, '2020/8/20-8/27', '於是我們選定日子 趁歲月凋謝前 猖狂地綻放 <br>\r\n於是我們拔除自己根上的刺 修剪身上的葉 <br>\r\n選定日子 趁歲月凋謝前 猖狂地綻放 <br>\r\n也就成為桌上那最亮眼的紅色饗宴 <br>\r\n', 'red', '8/14(六)23:59', '花面寬約45x20cm', '使用日本進口不凋花，由簡入深的插花技巧及系統式的教學<br>\r\n8個精選花型紮紮實實學會古典花藝插花的各項技巧 <br>\r\n每堂課程除實作外還添加了理論基礎的講解 <br>\r\n經典的古典花型運用現代的手法並帶入商業花藝手法 <br>\r\n', '18:30~20:30pm'),
(3, '桌花主題課程｜《撕裂狂藍》', 2000, '2020/9/5-9/6', '生於人類 我們張狂地需要被注意<br>\r\n我們渴望愛 我們想盡辦法接近溫暖<br>\r\n它喚起世人心中對於慶祝的渴望<br>\r\n不需要任何故事 <br>只要能有提醒自己活著的方式 就是最好的理由<br>\r\n\r\n', 'blue', '9/2(三)23:59', '花面寬約10×10×16cm', '將花朵最美麗的時光，收藏在優雅浪漫的玻璃音樂盒之中，<br>\r\n360度的旋轉設計，非常適合居家擺設或禮品贈送！<br>\r\n課程提供三款不同配色自行選擇，新手也能輕鬆完成夢幻作品。<br>', '15:00~17:00pm'),
(4, '捧花主題課程｜《耀眼白茫》', 2300, '2020/9/15-9/18', '我在一遍白茫裡找尋你<br>\r\n跟隨著所能發現的腳印<br>\r\n以為一切都終將因為刺眼而失去你的蹤跡<br>\r\n這是注定狂野的佳節 而我們聚在一起彼此依偎<br>\r\n', 'white', '9/12(六)23:59', '手綁捧花32x34cm <br>\r\n胸花14x9cm <br>', '手綁捧花－近年流行的捧花樣式，隨性自然的風格 <br>\r\n不凋花材一般以鐵絲加工花莖，很難做出自然的螺旋花腳 <br>\r\n這堂課程會教你如何修飾花莖，以及螺旋花腳的綁法 <br>\r\n讓捧花可以穩穩地站在桌上，展現出自然的線條和美麗的花面 <br>', '20:00~22:00pm'),
(5, '桌花主題課程｜《甜粉等待》', 3200, '2020/10/1-10/08', '你帶著一慣的蹣跚腳步 在街燈閃爍下遇見了我<br>\r\n我正踢掉高跟鞋  在擁擠裡尋找出口<br>\r\n如果說這市景的霓虹 往後有你一起走過<br>\r\n那麼這相遇便算值得等候<br>', 'pink', '9/25(五)23:59', '手捧型捧花58x32cm<br>\r\n兩用式花冠全長54cm<br>', '手捧型捧花－大型的手捧型捧花最適合外拍使用，<br>\r\n環抱在手裡或是隨興的拿著都能為新娘增添女神感，<br>\r\n捧花不僅使用大型乾燥花材，也搭配了許多不凋花材提升質感，<br>\r\n花冠－現在最流行的空氣感，一戴上就仙氣滿滿的設計<br>', '18:00-20:00pm'),
(6, '桌花主題課程｜《澄盡想念》', 2800, '2020/10/10-10/17', '如果說有什麼能形容你 那麼我會想起在加州海岸那一片日落<br>\r\n你恣意在沙灘上奔走 恣意的讓陽光深色了皮膚<br>\r\n浪沖走了我的孤單和寂寞 沙磨去了我們之前的衝突與困惑<br>\r\n海岸線沒有盡頭 而我和你也沒有盡頭<br>', 'orange', '10/02(五)23:59', '花面寬約45x70cm', '使用日本進口不凋花，搭配多種特色手工花<br>\r\n製作出與一般手綁花束不同的特大花束<br>\r\n運用韓系包裝技巧，以豪華氣勢襯托出不凋花的高質感<br>', '19:30~21:30pm');

-- --------------------------------------------------------

--
-- 資料表結構 `coursecate`
--

CREATE TABLE `coursecate` (
  `sid` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `parent_sid` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 資料表結構 `favorite`
--

CREATE TABLE `favorite` (
  `sid` int(11) NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- 資料表結構 `layout`
--

CREATE TABLE `layout` (
  `sid` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `time` date NOT NULL,
  `intro1` text NOT NULL,
  `intro2` text NOT NULL,
  `intro3` text NOT NULL,
  `intro4` text NOT NULL,
  `eg_name` varchar(255) NOT NULL,
  `designer` varchar(255) NOT NULL,
  `designer_intro` varchar(255) NOT NULL,
  `layout_img` varchar(255) NOT NULL,
  `designer_img` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `layout`
--

INSERT INTO `layout` (`sid`, `name`, `time`, `intro1`, `intro2`, `intro3`, `intro4`, `eg_name`, `designer`, `designer_intro`, `layout_img`, `designer_img`) VALUES
(1, '粉白甜蜜', '2020-05-20', '戶外證婚區的部分，使用和諧的白綠配色做設計，白花叢由入口處拍照區開始蔓延至證婚拱門，由下至上透著勃勃生機，望眼過去，皆是優雅潔白的白色花漾與鮮嫩的綠葉，再加上上天的禮物，萬里無雲的好天氣，整體乾淨、神聖且美好。\r\n', '明媚的陽光下，利用純白的鮮花搭乘一座愛的拱門，異地戀的距離並未拉開兩人的愛戀，反而讓他們一起看到更加廣闊的世界：芬蘭薩里山玻璃極光、京都清水寺幸福禦守、巴薩羅娜世界杯吶喊、馬爾代夫藍海清風..等。白色是純潔，後被引申為愛，它是起點，讓色彩可以任意揮灑；綠色是自然的恩賜，生命的起始；純粹的白與清新的綠相遇，是生命給愛的最好祝願。\r\n', '進入廳內，也是這場客製化婚禮設計中最令人驚喜的，全廳裝飾中運用到的線條元素，各種唯美的花藝紋路及垂墜感拍照背板，既立體又有秩序，華麗與貴氣兼具。而低調的銀白色和香檳金與粉紅色的相遇，不過於耀眼花俏，襯托出線條的完美，高貴而不高調的氣質，讓這場婚禮更加迷人。', '透明感線幔充分表現出新人想要傳達出的童話意境，線條與層次的變幻，帶來一股溫柔的浪漫情懷。優雅的粉色配色，在紗幔、線幔、水晶這些佈置的襯托下，層次感分明又連貫而且絲毫不甜膩，塑造出一種浪漫又典雅的風格。空氣中粉紅色的因子凝固成甜蜜的耳語，他和她之間的時間萬物。', 'SWEET PINK', 'Denny Chen', '真心的投入就會非常有感覺；用心聆聽客戶需求，從中捕捉我想要找的感動，對我來說是啟動創意重要的來源。天馬行空的想像力，恣意發揮，為每位客戶的需求，塑造獨有的特色。', '2', '02'),
(2, '薰紫微粉', '2020-02-16', '利用原有的歐式風格裝潢及流通的動線，我們將打造一場浪漫的歐式花園風格婚禮，不用出國也能沉浸在這趟美好的旅程。Grand Ville外的潔淨的白長廊，利用白色大理石砌成，在每座拱門之間皆設計垂掛式的水晶燈，增加此區質感，也增加了幾分唯美。', '以薰衣草紫色為主色系的婚禮主題，搭配粉色及乾燥色系，整體色調溫柔典雅，呈現歐式小花園氛圍。兩側以花叢及木箱做延伸，為清新小花園的一隅。', '捧花也利用與小花園同款乾燥色系設計，搭配蕾絲禮服，充滿復古歐式風情。落地玻璃的另一邊，便來到了戶外證婚區，與戶外自然元素呼應，此區利用木頭拱門\r\n做拍照背板設計。\r\n', '粉嫩色系的花藝搭配花牆佈置設計，輔以清新的青綠草地，鋪上粉色紗幔點綴，為整體多了一分，在陽光照射下，完美演繹浪漫氣息。<br>Peonies make fine sentinels lining walkways or a lovely low hedge. After its stunning bloom, the peony’s bushy clump of handsome glossy green leaves lasts all summer, and then turns purplish-red or gold in the fall, as stately and dignified as any flowering shrub.', 'LAVENDER FEELING', 'J.R.R Tolkien', '傾聽最細膩的聲音，讓整個充滿愛與溫馨；用最簡約的花朵畫出幸福的輪廓，兼具美學與機能的量身設計，不單止是設計一個空間，而是營造出獨特專屬的個人品味。', '1', '03'),
(3, '繡綠白靜', '2020-05-10', '相較以往田園風都是以綠白色系或是偏米色調的組合，這次以粉紫色與天空藍搭配白色，象徵藍天白雲，為田園鄉村風客製化婚禮設計增添了一抹幽靜。離開喧鬧的城市，來到世外桃源，是許多人心中嚮往的生活。', '證婚區及拍照背板區為同一個設計，以拱門及鞦韆結合，利用與花藝色系相仿的布幔及紗幔，層次堆疊在拱門上，營造進入此仙境的大門。\r\n', '鞦韆以粉紫色與天空藍色系之花藝佈置，以花圈的概念作設計，走道兩側以繡球花、飛燕草等作為花叢，繡球花的花語為忠貞，指對愛情的忠貞及兩情相悅的永恆。也為這條路上多了一份意義，通過條路後的酸甜苦辣，都有彼此的陪伴。戶外婚禮長桌也是不可忽略的重要角色，以紫羅蘭色緞面桌旗貫穿，餐盤選用藍綠色調色系，與整場婚禮色系十分契合。', '桌面上的盆花以白玫瑰為主花藝搭配綠色植物，搭配深色器皿，而其他桌面上的小盆花利用高低透明玻璃器皿做搭配，婚禮小物推薦利用白色蠟燭穿插其中。椅背沒有過多的花藝裝飾，利用透明氣球與桌上的透明器皿搭配，整體呈現活潑帶點內斂的感\r\n覺。', 'ARCADIA', 'Rita Yang', '以強烈的堅持和熱情，投入花藝世界；獨到且大膽的配色眼光，巧妙地結合各種花葉間的不同質感，自由遊走在自然清新和都會時髦的風格間，跳脫傳統花藝設計的框架，以獨樹一格的美學著稱。', '3', '01'),
(4, '純白典雅', '2020-01-27', '白色是純潔，後被引申為愛，它是起點，讓色彩可以任意揮灑；綠色是自然的恩賜，生命的起始；純粹的白與清新的綠相遇，是生命給愛的最好祝願。', '進入廳內，也是這場婚禮中最令人驚喜的，全廳裝飾中運用到的線條元素，各種唯美的花藝紋路及垂墜感，既立體又有秩序，華麗與貴氣兼具。而低調的銀白色和香檳金與粉紅色的相遇，不過於耀眼花俏，襯托出線條的完美，高貴而不高調的氣質，讓這場婚禮更加迷人。', '透明感線幔充分表現出新人想要傳達出的童話意境，線條與層次的變幻，帶來一股溫柔的浪漫情懷。優雅的粉色配色，在紗幔、線幔、水晶這些佈置的襯托下，層次感分明又連貫而且絲毫不甜膩，塑造出一種浪漫又典雅的風格。', '空氣中粉紅色的因子凝固成甜蜜的耳語，他和她之間的時間萬物。每一段姻緣都是難能可貴的，彼此都是緣分給予的禮物，忠貞的花朵與代表驚喜浪漫的元素滲透在整個佈置當中。', 'PURE WHITE', 'Denny Chen', '真心的投入就會非常有感覺；用心聆聽客戶需求，從中捕捉我想要找的感動，對我來說是啟動創意重要的來源。天馬行空的想像力，恣意發揮，為每位客戶的需求，塑造獨有的特色。', 'Rosemary', '02'),
(5, '仙境', '2018-04-11', '和諧的白綠配色，在戶外證婚下顯得格外的清新自在。\r\n白花叢由入口處拍照區開始蔓延至證婚拱門，由下至上透著勃勃生機，', '望眼過去，皆是優雅潔白的白色花漾與鮮嫩的綠葉，再加上上天的禮物，萬里無雲的好天氣，整體乾淨、神聖且美好。<br>Peonies make fine sentinels lining walkways or a lovely low hedge. After its stunning bloom, the peony’s bushy clump of handsome glossy green leaves lasts all summer, and then turns purplish-red or gold in the fall, as stately and dignified as any flowering shrub.', '明媚的陽光下，利用純白的鮮花搭乘一座愛的拱門，異地戀的距離並未拉開兩人的愛戀，反而讓他們一起看到更加廣闊的世界.<br>Peonies thrive on benign neglect. Unlike most perennials, they don’t need to be dug and divided every few years.', '芬蘭薩里山玻璃極光、京都清水寺幸福禦守、巴薩羅娜世界杯吶喊、馬爾代夫藍海清風..等，帶領著賓客與他們一同見證及擁有著這屬於他們的時刻。', 'WONDERLAND', 'J.R.R Tolkien', '傾聽最細膩的聲音，讓整個充滿愛與溫馨；用最簡約的花朵畫出幸福的輪廓，兼具美學與機能的量身設計，不單止是設計一個空間，而是營造出獨特專屬的個人品味。', '4', '03'),
(6, '幸福的顏色', '2020-06-20', '隨著季節更迭、山嵐雲霧、朝陽夕照而改變面貌的日月潭，一直都吸引著人們對於這地方的嚮往。其中涵碧樓得天獨厚的所在，得到一方視野無可相比的最佳席位，無邊際的明鏡水景讓人們更加陶醉在日月潭的懷抱之中。', '幸福該是什麼樣的顏色？也許就如新娘那一襲蕾絲白紗，在純潔無垢之中增添上金色的閃耀星光，沒有其他色彩喧賓奪主，因為再多的顏色也不足以形容他們的愛。', '新娘夢想中的空中花園，有了涵碧樓山光水鏡圍繞，在自然浪漫的花拱門下，一起留下幸福的記憶。', '仰望天空，軟綿綿的棉花輕柔地漂浮著，新人夢想著只開一桌，於是這麼長長一桌的長餐桌晚宴就此開席。秋冬棉花象徵新人愛情的美好結果，和賓客們共享這獨一無二的晚宴，永遠記得新娘如雪花般純真的幸福笑靨。', 'YOU AND ME', 'J.R.R Tolkien', '傾聽最細膩的聲音，讓整個充滿愛與溫馨；用最簡約的花朵畫出幸福的輪廓，兼具美學與機能的量身設計，不單止是設計一個空間，而是營造出獨特專屬的個人品味。', '1', '03'),
(7, '浮貴牡丹', '2018-07-04', '茶園、遠山、古剎，晴空徐朗下的茶樹草木，陣陣微風送來茶香與花香。這樣一片美好的自然，已經是最美麗的舞台，於是在翠綠的茶園中，送上桃粉色的牡丹添上喜氣，在茶篩裡曬花瓣，茶簍裡插上花，茶園裡質樸的往常景緻，這一天顯得格外優雅動人！單純的因著花開、因著花瓣散落而成就這份美麗。以去蕪存菁的單純顏色，訴說出屬於東方的浪漫情懷，古雅有餘。', '牡丹，也許是眾人心中最美的一種花朵，脆弱而嬌貴；然而在這場婚禮裡，獨獨選用了這麼單一種花材，所求的不是奢華的展現、或著象徵富貴，而是因為這個季節裡正逢牡丹花期，兩個人彼此之間不需要刻意記住彼此是在哪個月份、何時互相承諾了對方，只要看見牡丹綻放，自然的更迭就會提醒新人們，他們又來到當初相許的季節，永遠都不會忘記這個特別的日子。花朵何嘗不是這個季節中，大自然對新人的祝福？', '婚禮的每一個時刻終將成為記憶，透過感官，記住婚禮當下的季節之美，我們的工作是在花、人與自然之間，創造出美好的互動。風中夾帶著茶香花香，讓人嚐到也嗅到不一樣的春天美好、入耳的鳥叫蟲鳴裡，可以聽見萬物甦醒的生命力，在茶園旁插上與牡丹同色的布旗，隨風飄揚也紀錄下春風掠過皮膚的感受。', '每個季節都自有不同的花朵盛開，其中我們追求的是觸動人心的「單純」，總希望能用最極簡的手法、花材、顏色，來表現讓人難忘的記憶。於是，當我們自問什麼是美？答案始終是那麼清晰：順應自然就是美的展現！', 'PEONY OF THE WORLD', 'Denny Chen', '真心的投入就會非常有感覺；用心聆聽客戶需求，從中捕捉我想要找的感動，對我來說是啟動創意重要的來源。天馬行空的想像力，恣意發揮，為每位客戶的需求，塑造獨有的特色。', 'Rosemary', '02'),
(8, '黑暗之光', '2019-07-21', '忘了幾歲以後，我們才長得夠大成為不再害怕黑暗的大人。黑色有著神秘、恐怖、未知以及毀滅一切的聯想，但往往我們覺得最有希望的時刻，也是在黑暗中看見曙光的那一剎那。黑暗中的光使人專注，如同半夜攻頂山頭時腳下的光，領著我們一步一步踏實地前行；黑暗中的光使人清明，如同黑夜繁星，像是智者對我們眨眼；黑暗中的光給人盼望，如同煙花絢爛，我們一起抬頭想望。', '『海靠近我，空氣濕了<br>    \r\n美麗的夢，請別遠走  <br>  \r\n繁星亮起，宇宙甦醒  <br>  \r\n黑暗溫柔，改變過我』<br>', '「就算我們生活在陰溝，仍有人仰望著星空。」\r\n《黑暗之光》山區的冬天在其戲劇中令人著迷，光線在布雷肯信標上融化，彷彿它在寒冷而不是高溫。 也有薄霧的湖泊，當陽光透過蕨紅色的山脊穿過珠光的雲層時，高高地飛過，像鯨魚一樣隆起。', '睜開眼，少年眼前是全然陌生的房間。<br>\r\n昏暗的燈光、綁縛的手腳，在在說明綁架的事實。<br>\r\n過著反覆日常的富裕少年...<br>\r\n為了生活掙扎的偏激少女...<br>\r\n立場迥異的兩人，長達數日的監禁中.<br>\r\n碰觸不曾了解的世界、動搖根深蒂固的成見。', 'THE LIGHT IN THE DARK', 'J.R.R Tolkien', '自由插畫家、設計師，畢業於國立臺北藝術大學戲劇學系，非美術科班出身、卻能以自由的雜食精神，開創出自己的道路。擅長融合印染、繪畫、刺繡…等技法，秉持自由創作的精神，擁有鮮明專屬藝術風格！ ', 'Black-BAR', '03');

-- --------------------------------------------------------

--
-- 資料表結構 `member`
--

CREATE TABLE `member` (
  `id` int(11) NOT NULL,
  `email` varchar(255) CHARACTER SET utf8 NOT NULL,
  `password` varchar(255) CHARACTER SET utf8 NOT NULL,
  `mobile` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `county` varchar(11) CHARACTER SET utf8 DEFAULT NULL,
  `city` varchar(11) CHARACTER SET utf8 DEFAULT NULL,
  `address` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `birthday` date DEFAULT NULL,
  `hash` varchar(255) CHARACTER SET utf8 NOT NULL,
  `activated` int(11) NOT NULL DEFAULT 0,
  `nickname` varchar(255) CHARACTER SET utf8 NOT NULL,
  `create_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `member`
--

INSERT INTO `member` (`id`, `email`, `password`, `mobile`, `county`, `city`, `address`, `birthday`, `hash`, `activated`, `nickname`, `create_at`) VALUES
(1, 'ming0817@gg.com', '273a0c7bd3c679ba9a6f5d99078e36e85d02b952', '0911111111', '臺南市', '官田區', '大安區大安區大安區', '2020-07-29', 'cc72fe71bf1cb067a3ca41905dc4ec2f', 0, '林阿陳', '2020-08-17 11:41:58'),
(2, 'glory0502@gmail.com', 'c984aed014aec7623a54f0591da07a85fd4b762d', '0933618469', '', '', '', '2020-08-17', '077fdde999a65db7d9842a92dc832c09', 0, 'Ying Chen Lin', '2020-08-17 17:05:46'),
(3, 'ming0818@gg.com', '3d4f2bf07dc1be38b20cd6e46949a1071f9d0e3d', '0913133331', '新北市', '林口區', '阿里一哩一ㄌ哩ㄌ', '2020-08-05', '9bd81e8e371493126967b610a7f74890', 0, 'JOJO', '2020-08-18 15:47:02');

-- --------------------------------------------------------

--
-- 資料表結構 `orders`
--

CREATE TABLE `orders` (
  `sid` int(11) NOT NULL,
  `member_sid` int(11) NOT NULL,
  `amount` int(11) NOT NULL,
  `order_date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `orders`
--

INSERT INTO `orders` (`sid`, `member_sid`, `amount`, `order_date`) VALUES
(1, 1, 20480, '2020-08-17'),
(2, 1, 4800, '2020-08-17'),
(3, 3, 21140, '2020-08-18');

-- --------------------------------------------------------

--
-- 資料表結構 `order_detail`
--

CREATE TABLE `order_detail` (
  `sid` int(11) NOT NULL,
  `member_sid` int(11) NOT NULL,
  `order_date` date NOT NULL,
  `order_sid` int(11) NOT NULL,
  `product_name` text CHARACTER SET utf8 NOT NULL,
  `product_sid` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `quantity` int(11) NOT NULL,
  `size` varchar(100) NOT NULL,
  `img_small` varchar(100) CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `order_detail`
--

INSERT INTO `order_detail` (`sid`, `member_sid`, `order_date`, `order_sid`, `product_name`, `product_sid`, `price`, `quantity`, `size`, `img_small`) VALUES
(1, 1, '2020-08-17', 1, '淡粉甜玫', 1, 2880, 1, '30×30×40cm', 'sweet'),
(2, 1, '2020-08-17', 1, '白紡蕾絲', 6, 2800, 1, '45X40x30cm', 'les'),
(3, 1, '2020-08-17', 1, '粉繡之庭', 10, 4800, 1, '50x70x55cm', 'circle'),
(4, 1, '2020-08-17', 1, '春之戀想', 12, 2500, 4, '禮盒17×18cm', 'think'),
(5, 1, '2020-08-17', 2, '白水夏蓮', 2, 4800, 1, '50x60x55cm', 'water'),
(6, 3, '2020-08-18', 3, '淡粉甜玫', 1, 2880, 3, '30×30×40cm', 'sweet'),
(7, 3, '2020-08-18', 3, '綠境', 7, 2500, 5, '30×30×40cm', 'green');

-- --------------------------------------------------------

--
-- 資料表結構 `product`
--

CREATE TABLE `product` (
  `sid` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `price` int(11) NOT NULL,
  `time` date NOT NULL,
  `color` int(11) NOT NULL,
  `style` varchar(30) NOT NULL,
  `category` int(11) NOT NULL,
  `img_small` varchar(255) NOT NULL,
  `img_big` varchar(255) NOT NULL,
  `size` varchar(255) NOT NULL,
  `flower` varchar(255) NOT NULL,
  `intro` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `product`
--

INSERT INTO `product` (`sid`, `name`, `price`, `time`, `color`, `style`, `category`, `img_small`, `img_big`, `size`, `flower`, `intro`) VALUES
(1, '淡粉甜玫', 2880, '2020-07-01', 6, '2', 3, 'sweet', '', '30×30×40cm', '玫瑰、鬱金香、桔梗、康乃馨', '粉玫瑰花語：初戀、求愛、愛心。<br>鬱金香花語：永恆、愛的表白、永恆的祝福。<br>桔梗花的花語:真誠不變的愛。<br>康乃馨花語：熱情、魅力、使人柔弱的愛、真情。'),
(2, '白水夏蓮', 4800, '2020-07-21', 1, '3,4', 3, 'water', '', '50x60x55cm', '玫瑰、繡球、鬱金香、尤佳利、桔梗、石蓮(依季節不同)', '鬱金香花語：永恆、愛的表白、永恆的祝福。<br>桔梗花的花語:真誠不變的愛。<br>石蓮花的花語：永不凋謝的愛。<br>尤加利花語:恩賜<br>。繡球花的花語:忠貞、永恆。'),
(3, '紅玫山野', 4800, '2020-06-04', 3, '1,2', 3, 'mt', '', '50x60x55cm', '玫瑰、乒乓菊、鬱金香 ', '鬱金香花語：永恆、愛的表白、永恆的祝福。<br>紅玫瑰花語：熱戀、熱情、熱愛、希望與你泛起激情的愛。<br>乒乓菊花語:圓滿。'),
(4, '香檳花園', 3500, '2020-07-30', 2, '1,4,5', 3, 'gd', '', '60x65cm', '香檳玫瑰 繡球 翠珠 蕾絲 康乃馨 桔梗(白色包裝紙，咖啡色襯紙)', '香擯玫瑰花語:夢幻的感覺。<br>桔梗花的花語:真誠不變的愛。<br>繡球花的花語:忠貞、永恆。<br>康乃馨花語：熱情、魅力、使人柔弱的愛、真情。<br>翠珠:祝你幸福，優雅的愛好和無言的愛。'),
(6, '白紡蕾絲', 2800, '2020-04-15', 1, '1,3', 3, 'les', '', '45X40x30cm', '白玫瑰 蕾絲花 松蟲草(黑色包裝紙,白色襯紙)', '白玫瑰花語:我足以與你相配，你是唯一與我相配的人。<br>蕾絲花花語:惹人憐愛的心。<br松蟲草:追憶。'),
(7, '綠境', 2500, '2020-03-23', 1, '4,5', 3, 'green', '', '30×30×40cm', '綠乒乓、綠石竹、山防風、商陸、伯利恆、春蘭葉、小薊花、山蘋果', '小薊花花語:默默的愛。<br>春蘭葉花語：遲來的愛。<br>綠石竹花語:純淨的愛。<br>乒乓菊花語:圓滿。<br>山防風花語: 永恆的愛。<br>伯利恆花語:敏感。'),
(8, '怦然心動', 5800, '2020-05-28', 6, '2,4,5', 3, 'heart', '', '75×45×60cm', '進口粉玫、進口白玫、虹彩木、白色薊花', '白玫瑰花語:我足以與你相配，你是唯一與我相配的人。<br>粉玫瑰花語:初戀，特別的關懷，喜歡你那燦爛的微笑。<br>小薊花花語:默默的愛。'),
(10, '粉繡之庭', 4800, '2020-04-24', 6, '1,2,5', 3, 'circle', '', '50x70x55cm', '玫瑰、乒乓菊、粉繡球、康乃馨', '粉玫瑰花語:初戀，特別的關懷，喜歡你那燦爛的微笑。<br>乒乓菊花語:圓滿。<br>康乃馨花語：熱情、魅力、使人柔弱的愛、真情。<br>粉繡球花花語:期待愛情。'),
(11, '夢幻花饗', 2800, '2020-08-05', 2, '1', 2, 'dream', '', '24x4x4cm', '多肉、進口橘玫、粉乒乓、膚色康乃馨、草莓果、粉桔', '乒乓菊花語:圓滿。<br>康乃馨花語：熱情、魅力、使人柔弱的愛、真情。<br>橘玫瑰:羞怯、獻給你一份神祕的愛。<br>桔梗花的花語:真誠不變的愛。'),
(12, '春之戀想', 2500, '2020-01-15', 4, '1,4', 2, 'think', '', '禮盒17×18cm', '桔梗、玫瑰、多肉、綠石竹', '粉玫瑰花語:初戀，特別的關懷，喜歡你那燦爛的微笑。<br>橘玫瑰:羞怯、獻給你一份神祕的愛。<br>桔梗花的花語:真誠不變的愛。<br>綠石竹花語:純淨的愛。'),
(13, '粉紅泡泡', 4000, '2020-05-27', 6, '1,2,4', 2, 'bubble', '', '38×38×43cm', '迷你玫瑰、康乃馨、腕豆花、風信子、桔梗', '粉玫瑰花語:初戀，特別的關懷，喜歡你那燦爛的微笑。<br>桔梗花的花語:真誠不變的愛<br>。康乃馨花語：熱情、魅力、使人柔弱的愛、真情。<br>粉色風信子的花語：永遠的懷念。'),
(14, '粉春派對', 2600, '2020-04-17', 2, '1,4', 2, 'party', '', '28×28×26cm', '康乃馨、玫瑰、聖誕玫瑰', '粉玫瑰花語:初戀，特別的關懷，喜歡你那燦爛的微笑。<br>康乃馨花語：熱情、魅力、使人柔弱的愛、真情。<br>聖誕玫瑰花語:矛盾。'),
(15, '白綠春日', 3500, '2020-06-24', 1, '3', 2, 'spring', '', '70×25×53cm', '繡球、綠石竹、火鶴', '綠石竹花語:純淨的愛。<br>繡球花的花語:忠貞、永恆。<br>火鶴的花語:燃燒的心、熱情、關懷與衷心的祝福。'),
(16, '繽紛夏至 ', 2800, '2020-03-17', 2, '1,4,5', 2, 'wood', '', '27x27x17cm', '蘭花、多肉、海芋、迷你鳳梨、綠石竹、葉材', '綠石竹花語:純淨的愛。<br>蘭花花語:高潔、高雅、美好。<br>海芋花的花語：純潔、幸福、清秀、純凈的愛。<br>竹子的花語：生命的柔韌堅強、青春永駐、氣節和傲骨。'),
(17, '甜蜜花嫁捧花', 4000, '2020-01-24', 1, '2,5', 1, 'wedding', '', '28×30cm', '艾瑪百合、玫瑰、泡盛花、新娘花、桔梗、尤加利葉', '粉玫瑰花語:初戀，特別的關懷，喜歡你那燦爛的微笑。<br>桔梗花的花語:真誠不變的愛。<br>艾瑪百合花語：渴望被愛。<br>新娘花花語:相伴一生。<br>泡盛花花語:戀愛的來臨。<br>尤加利花語:恩賜。'),
(18, '邱比特之吻捧花', 3500, '2019-12-19', 3, '2,5', 1, 'cupid', '', '28×30cm', '繡球、東亞蘭、泡盛花、進口玫瑰、桔梗', '桔梗花的花語:真誠不變的愛。<br>淡紅玫瑰花語：明豔照人、感動、愛的宣言。<br>泡盛花花語:戀愛的來臨。<br>繡球花的花語:忠貞、永恆。<br>東亞蘭花語:祝福。'),
(19, '艾瑪百合捧花', 5000, '2020-08-07', 1, '3,5', 1, 'emma', '', '28×30cm', '白色愛瑪百合、綠果', '艾瑪百合花語：渴望被愛。'),
(21, '白蘋果頭花', 200, '2020-05-22', 1, '1,3,5', 1, 'apple', '', '30×5cm', '白蘋果、白臘梅', '臘梅花語：堅強不屈，有傲骨，貞潔，哀愁悲懷的慈愛心。<br>蘋果花花語:陷阱。'),
(22, '夏光花冠', 2000, '2020-06-14', 2, '1,4,5', 1, 'summertime', '', '30×12cm', '黃東亞蘭五朵，黃橘色配花(隨季節更動)', '東亞蘭花語:祝福。'),
(23, '星星點點頭花', 2000, '2020-03-26', 6, '1', 1, 'starhead', '', '30×5cm', '粉蠟梅、史考梅', '臘梅花語：堅強不屈，有傲骨，貞潔，哀愁悲懷的慈愛心。'),
(24, '澄夏捧花', 2580, '2020-03-02', 2, '1,4,5', 3, 'os', '', '30X35cm', '白玫瑰、橘玫瑰、咸豐草', '白玫瑰花語:我足以與你相配，你是唯一與我相配的人。<br>橘玫瑰:羞怯、獻給你一份神祕的愛。'),
(25, '鬱金香小花束', 380, '2020-03-10', 6, '1,4,5', 3, 'tulip', '', '25x10cm', '進口鬱金香', '鬱金香花語：永恆、愛的表白、永恆的祝福。'),
(26, '太陽花小花束', 280, '2020-05-20', 2, '1,5', 3, 'sunflower', '', '60X10cm', '進口乾燥花材(太陽花)', '太陽花花語:花語：光輝、高傲、忠誠、愛慕、勇敢的去追求自己想要的幸福、沉默的愛。'),
(27, '柏林藍', 1580, '2020-08-07', 5, '1,2,3', 3, 'berlin', '', '35X25cm', '進口乾燥花材(藍玫瑰、白雛菊)', '藍玫瑰花語：奇蹟與不可能實現的事，代表清純的愛和敦厚善良。<br>白雛菊花語:暗戀、快樂、離別。'),
(28, '寧靜小雛菊', 2280, '2020-04-29', 5, '1,3', 3, 'no', '', '45X35cm', '進口乾燥花材(藍玫瑰、白雛菊)', '藍玫瑰花語：奇蹟與不可能實現的事，代表清純的愛和敦厚善良。<br>白雛菊花語:暗戀、快樂、離別。'),
(29, '幸福一輩子', 1980, '2020-05-13', 4, '1,4', 3, 'life', '', '45X35cm', '奶茶色康乃馨、桔梗', '康乃馨花語：熱情、魅力、使人柔弱的愛、真情。<br>桔梗花的花語:真誠不變的愛。'),
(30, '激情暗黑', 1380, '2020-03-16', 3, '1,2', 3, 'dark', '', '30x40x35cm', '紅玫瑰、海芋、桔梗、臘梅', '紅玫瑰花語：熱戀、熱情、熱愛、希望與你泛起激情的愛。<br>桔梗花的花語:真誠不變的愛。<br>海芋花的花語：純潔、幸福、清秀、純凈的愛。<br>臘梅花語：堅強不屈，有傲骨，貞潔，哀愁悲懷的慈愛心。'),
(31, '巨大鮮花束', 6800, '2020-02-11', 4, '1', 3, 'big', '', '80x120cm', '繡球花、康乃馨、桔梗、千日紅', '康乃馨花語：熱情、魅力、使人柔弱的愛、真情。<br>桔梗花的花語:真誠不變的愛。'),
(32, '流星花園', 1380, '2020-05-01', 1, '5', 3, 'star', '', '20x30x25cm', '伯利恆之星、蓮蓬、四季迷、綠桔梗', '桔梗花的花語:真誠不變的愛。<br>伯利恆之星的花語:敏感。<br>四季迷的花語:熱血。'),
(33, '夢幻', 1980, '2020-07-04', 6, '1,4', 3, 'wonder', '', '30x40x25cm', '進口粉玫瑰、白大康', '粉玫瑰花語:初戀，特別的關懷，喜歡你那燦爛的微笑。<br>康乃馨花語：熱情、魅力、使人柔弱的愛、真情'),
(34, '像極了愛情', 2999, '2020-08-03', 4, '1,5', 3, 'feel', '', '30x40x25cm', '古典牡丹菊、綠乒乓、紫桔梗、四季迷、尤加利、綠桔梗', '尤加利花語:恩賜。<br>四季迷的花語:熱血。<br>桔梗花的花語:真誠不變的愛。<br>乒乓菊花語:圓滿。'),
(35, '森林系少女', 1280, '2020-02-25', 1, '5', 3, 'Forest', '', '20x40x20cm', '桔梗、紫薊', '紫薊的花語:堅持。<br>桔梗花的花語:真誠不變的愛。'),
(36, '青澀時代', 1500, '2020-04-24', 6, '1,4', 3, 'yg\r\n', '', '50x55cm', '桔梗、尤加利', '桔梗花的花語:真誠不變的愛。<br>尤加利花語:恩賜。'),
(37, '粉霓裳', 2980, '2020-06-23', 6, '2,5', 3, 'cloth', '', '30x40x30cm', '粉桔梗、粉玫瑰', '桔梗花的花語:真誠不變的愛。<br>粉玫瑰花語:初戀，特別的關懷，喜歡你那燦爛的微笑。'),
(38, '希望', 3200, '2020-07-01', 3, '2,4', 3, 'hope', '', '20x30x25cm', '桃紅玫瑰、順風桔梗、海芋、乒乓菊', '桔梗花的花語:真誠不變的愛。<br>乒乓菊花語:圓滿。<br>海芋花的花語：純潔、幸福、清秀、純凈的愛。<br>紅玫瑰花語：熱戀、熱情、熱愛、希望與你泛起激情的愛。'),
(39, '獻，誨我諄諄的你', 3200, '2020-08-09', 5, '1,3', 3, 'you', '', '30x40x30cm', '藍玫瑰、鬱金香、桔梗', '桔梗花的花語:真誠不變的愛。<br>藍玫瑰花語：奇蹟與不可能實現的事，代表清純的愛和敦厚善良。<br>鬱金香花語：永恆、愛的表白、永恆的祝福。'),
(40, '彩虹小馬', 980, '2020-05-23', 1, '2,4', 4, 'horse', '', '20x40x20cm', '彩色滿天星、銅線燈', '滿天星的花語:思念、青春、夢境、真心喜歡。'),
(41, '做自己的光', 1580, '2020-04-01', 2, '5', 3, 'light', '', '30x40x30cm', '向日葵、迷你太陽', '太陽花花語:花語：光輝、高傲、忠誠、愛慕、勇敢的去追求自己想要的幸福、沉默的愛。'),
(42, '愛的宣言', 2500, '2020-03-22', 6, '2,4', 3, 'lw', '', '30x40x30cm', '粉玫瑰', '粉玫瑰花語：初戀、求愛、愛心。<br>鬱金香花語：永恆、愛的表白、永恆的祝福。'),
(43, '永遠18歲', 2980, '2020-03-31', 4, '2', 4, 'age', '', '30x40x25cm', '紫玫瑰、粉玫瑰、雪柳', '粉玫瑰花語：初戀、求愛、愛心。鬱金香花語：永恆、愛的表白、永恆的祝福。<br>紫玫瑰花語:浪漫真情和珍貴獨特的愛情。<br>雪柳花語:殊勝。'),
(44, '老婆是用來疼的', 2580, '2020-05-16', 5, '1,2', 3, 'wife', '', '20x20cm', '粉繡球、藍繡球、白玫瑰、白乒乓', '白玫瑰花語:我足以與你相配，你是唯一與我相配的人。<br>乒乓菊花語:圓滿。<br>繡球花的花語:忠貞、永恆。'),
(45, '青春不散場', 1980, '2020-04-16', 4, '1,3', 4, 'never', '', '20x30x25cm', '紫玫、奶茶大康', '紫玫瑰花語:浪漫真情和珍貴獨特的愛情。<br>康乃馨花語：熱情、魅力、使人柔弱的愛、真情'),
(46, '雪白的夢', 1999, '2020-03-08', 1, '3', 4, 'wd', '', '20x40x20cm', '白玫瑰、白乒乓、文心蘭', '白玫瑰花語:我足以與你相配，你是唯一與我相配的人。<br>乒乓菊花語:圓滿。'),
(47, '你的肩膀', 1880, '2020-04-03', 3, '2,4', 3, 'shoulder', '', '40x50x40cm', '古典粉大康、暗紅大康、紅桔梗', '桔梗花的花語:真誠不變的愛。<br>康乃馨花語：熱情、魅力、使人柔弱的愛、真情。'),
(48, '以愛為題', 2580, '2020-05-07', 1, '1,2,3', 3, 'lovename', '', '40x50x40cm', '紫玫瑰、白桔梗', '紫玫瑰花語:浪漫真情和珍貴獨特的愛情。<br>桔梗花的花語:真誠不變的愛。'),
(49, '人海中遇見你', 3580, '2020-03-03', 5, '1,2,3', 3, 'sea', '', '40x50x40cm', '藍玫瑰、紫薊', '藍玫瑰花語：奇蹟與不可能實現的事，代表清純的愛和敦厚善良。<br>小薊花花語:默默的愛。'),
(50, '下過雨的江南', 3999, '2020-01-17', 6, '1,2,4,5', 3, 'river', '', '40x50x40cm', '粉玫瑰、繡球花', '粉玫瑰花語：初戀、求愛、愛心。<br>繡球花的花語:忠貞、永恆。'),
(51, '愛的樂章', 3580, '2020-02-01', 6, '1,2,4', 3, 'music', '', '20x40x20cm', '粉玫瑰', '粉玫瑰花語：初戀、求愛、愛心。'),
(52, '純潔的愛', 4280, '2020-01-22', 1, '3', 3, 'clean', '', '40x50x40cm', '白玫瑰', '白玫瑰花語:我足以與你相配，你是唯一與我相配的人。'),
(53, '無盡', 1880, '2020-02-29', 4, '1,5', 3, 'end', '', '30x40x30cm', '紫玫瑰', '紫玫瑰花語:浪漫真情和珍貴獨特的愛情。'),
(54, '私藏美麗', 1999, '2020-01-18', 6, '1,2,4', 3, 'pretty', '', '20x30x25cm', '粉玫瑰、粉桔梗', '粉玫瑰花語：初戀、求愛、愛心。<br>桔梗花的花語:真誠不變的愛。'),
(55, '最美的風景', 2980, '2020-02-07', 6, '1,2,4', 3, 'view', '', '30x40x25cm', '進口玫瑰、順風桔梗、翠珠', '粉玫瑰花語：初戀、求愛、愛心。<br>翠珠:祝你幸福，優雅的愛好和無言的愛。<br>桔梗花的花語:真誠不變的愛。'),
(56, '愛上你的第一天', 1880, '2020-01-21', 1, '1,3', 3, 'day', '', '50x60x55cm', '白玫、桔梗', '桔梗花的花語:真誠不變的愛。<br>白玫瑰花語:我足以與你相配，你是唯一與我相配的人。'),
(57, '如果我愛你', 999, '2020-04-19', 3, '5', 4, 'iflove', '', '10x10x10cm', '白菊花', '菊花的花語:高潔、清淨、我愛你。'),
(58, '午茶時光', 1580, '2020-04-04', 2, '1,3,5', 4, 'tea', '', '50x60x55cm', '山茂堅、深藍色手工太陽玫瑰、白色滿天星', '滿天星的花語是思念、青春、夢境、真心喜歡。<br>山茂堅的花語:堅強的守護。<br>太陽玫瑰的花語：永恆的愛戀。'),
(59, '心之所向', 1280, '2020-08-17', 5, '1,3', 4, 'location', '', '20x30x25cm', '白色棉花、藍色手工太陽玫瑰、藍色滿天星', '滿天星的花語是思念、青春、夢境、真心喜歡。<br>太陽玫瑰的花語：永恆的愛戀。'),
(60, '奶油吐司', 1500, '2020-01-31', 2, '1,5', 4, 'toast', '', '25x20x25cm', '太陽玫瑰、滿天星、兔尾草、圓仔花', '滿天星的花語是思念、青春、夢境、真心喜歡。<br>太陽玫瑰的花語：永恆的愛戀。'),
(61, '小太陽', 1200, '2020-05-25', 3, '1,2', 4, 'little', '', '12x12x15cm', '手工太陽玫瑰', '太陽玫瑰的花語：永恆的愛戀。'),
(62, '金黃燦爛', 1980, '2020-01-27', 2, '4', 3, 'bot', '', '60x65cm', '乒乓菊', '乒乓菊花語:圓滿。'),
(63, '烈霞', 2980, '2020-06-08', 3, '2,5', 3, 'fire', '', '38×38×43cm', '扶桑花', '扶桑花的花語：新鮮的戀情，微妙的美。'),
(64, '冬日', 3780, '2020-07-05', 1, '3', 3, 'winter', '', '28×30cm', '艾瑪百合', '艾瑪百合花語：渴望被愛。'),
(65, '白玉團暖', 1580, '2019-12-13', 1, '3', 3, 'jade', '', '30X35cm', '滿天星、棉花', '滿天星的花語:思念、青春、夢境、真心喜歡。'),
(66, '白雪公主', 3500, '2020-06-19', 3, '2,3', 0, 'snow', '', '40x50x40cm', '白玫瑰、紅玫瑰', '白玫瑰花語:我足以與你相配，你是唯一與我相配的人。<br>紅玫瑰花語：熱戀、熱情、熱愛、希望與你泛起激情的愛。'),
(67, '白皚', 2500, '2020-08-04', 1, '1,3', 3, 'allwhite', '', '20x30x25cm', '桔梗', '桔梗花的花語:真誠不變的愛。'),
(68, '明豔', 3780, '2020-06-07', 2, '1,4', 4, 'lighter', '', '45×35×55cm', '紅玫瑰、白玫瑰、橘玫瑰', '紅玫瑰花語：熱戀、熱情、熱愛、希望與你泛起激情的愛。<br>白玫瑰花語:我足以與你相配，你是唯一與我相配的人。<br>橘玫瑰:羞怯、獻給你一份神祕的愛。'),
(69, '恬粉', 2350, '2020-05-05', 6, '1,2', 4, 'onlypink', '', '35X25cm', '鬱金香', '鬱金香花語：永恆、愛的表白、永恆的祝福。'),
(70, '春粉盪漾', 2800, '2020-04-27', 6, '1,2,4', 0, 'move', '', '20x30x25cm', '鬱金香', '鬱金香花語：永恆、愛的表白、永恆的祝福。'),
(71, '秋橘', 3200, '2020-02-09', 2, '4', 4, 'fall', '', '20x30x25cm', '鼠尾草', '鼠尾草的花語:熱烈的思念。'),
(72, '桔白', 2200, '2020-06-06', 1, '1,3', 4, 'owhite', '', '60x65cm', '桔梗花', '桔梗花的花語:真誠不變的愛。'),
(73, '粉白星星', 1500, '2020-08-04', 6, '1,2', 4, 'pinkstar', '', '20x40x20cm', '滿天星', '滿天星的花語:思念、青春、夢境、真心喜歡。'),
(74, '粉玫甜雅', 4200, '2020-01-08', 6, '1,2', 0, 'sweetrose', '', '30x40x30cm', '粉玫瑰', '粉玫瑰花語：初戀、求愛、愛心。'),
(75, '粉蘭', 4500, '2020-04-18', 1, '1,4', 3, 'orchid', '', '40x50x40cm', '蘭花', '蘭花的花語：美好、高潔、純樸、賢德、賢貞、俊雅。'),
(76, '純白浪漫', 3800, '2020-03-19', 1, '3,5', 3, 'roma', '', '50x60x55cm', '百合花', '百合花的花語:順利、心想事成、祝福、高貴純潔、心心相印、持久的愛。'),
(77, '耽美', 4800, '2020-04-05', 2, '1,5', 3, 'danger', '', '30×30×40cm', '黃玫瑰、粉玫瑰、橘玫瑰', '黃玫瑰花語：高貴、珍重祝福。<br>粉玫瑰花語:初戀，特別的關懷，喜歡你那燦爛的微笑。<br>橘玫瑰:羞怯、獻給你一份神祕的愛。'),
(78, '迷情', 3700, '2020-04-24', 6, '1,2', 3, 'mist', '', '28×28×26cm', '桔梗花、泡盛花', '桔梗花的花語:真誠不變的愛。<br>泡盛花花語:戀愛的來臨。'),
(79, '淡黃閃閃', 1980, '2019-12-24', 2, '1,4,5', 3, 'bling', '', '28×30cm', '滿天星', '滿天星的花語:思念、青春、夢境、真心喜歡。'),
(80, '淨白亮度', 1280, '2020-05-28', 1, '3,5', 3, 'tuwhite', '', '30×30×40cm', '鬱金香', '鬱金香花語：永恆、愛的表白、永恆的祝福。'),
(81, '深紫', 2150, '2020-03-13', 4, '1', 3, 'deep', '', '28×28×26cm', '桔梗花', '桔梗花的花語:真誠不變的愛。'),
(82, '紫醉金迷', 3200, '2020-02-21', 4, '1,5', 3, 'twocolor', '', '45×35×55cm', '薰衣草、滿天星', '薰衣草的花語:等待愛情。<br>滿天星的花語:思念、青春、夢境、真心喜歡。'),
(83, '粉色世界', 4200, '2020-04-14', 6, '1,2,4', 3, 'world', '', '40x50x40cm', '薰衣草、粉玫瑰、白玫瑰', '粉玫瑰花語：初戀、求愛、愛心。<br>白玫瑰花語:我足以與你相配，你是唯一與我相配的人。<br>薰衣草的花語:等待愛情。'),
(84, '黃玉點點', 1500, '2020-05-12', 2, '1,5', 3, 'dot', '', '20x30x25cm', '白玫瑰、滿天星', '白玫瑰花語:我足以與你相配，你是唯一與我相配的人。<br>滿天星的花語:思念、青春、夢境、真心喜歡。'),
(85, '暗戀', 2400, '2020-01-16', 6, '2,5', 3, 'deeplove', '', '25x20x25cm', '雛菊花、粉玫瑰', '粉玫瑰花語：初戀、求愛、愛心。<br>雛菊花的花語:天真、幸福、和平。'),
(86, '綠野仙蹤', 2800, '2020-02-24', 1, '4', 3, 'story', '', '30X35cm', '桔梗花、乒乓菊', '桔梗花的花語:真誠不變的愛。<br>乒乓菊花語:圓滿。'),
(88, '輕藍典緻', 4800, '2020-03-26', 5, '1,2,', 3, 'blue', '', '50x70x55cm', '藍玫瑰、白雛菊', '藍玫瑰花語：奇蹟與不可能實現的事，代表清純的愛和敦厚善良。<br>白雛菊花語:暗戀、快樂、離別。'),
(89, '繡球庭園', 4200, '2020-04-13', 5, '3,5', 3, 'bandw', '', '30x40x25cm', '繡球花、藍玫瑰', '繡球花的花語:忠貞、永恆。<br>藍玫瑰花語：奇蹟與不可能實現的事，代表清純的愛和敦厚善良。'),
(90, '藍色眼睛', 1200, '2020-02-22', 5, '1,5', 4, 'eye', '', '20x40x20cm', '滿天星', '滿天星的花語:思念、青春、夢境、真心喜歡。'),
(91, '耀眼光芒', 2500, '2020-04-02', 2, '1,5', 3, 'sunorg', '', '60X10cm', '太陽花', '太陽花花語:花語：光輝、高傲、忠誠、愛慕、勇敢的去追求自己想要的幸福、沉默的愛。'),
(92, '艷紅奔放', 3800, '2020-07-30', 3, '2', 3, 'run', '', '50x60x55cm', '紅玫瑰', '紅玫瑰花語：熱戀、熱情、熱愛、希望與你泛起激情的愛。'),
(94, '詩意', 1800, '2019-12-05', 4, '5', 3, 'poem', '', '20x40x20cm', '繡球花', '繡球花花語:忠貞、永恆。'),
(102, '紅寶石玫瑰束花', 800, '2020-06-25', 3, '2', 1, 'ruby', '', '10×5cm', '紅玫瑰兩朵、泡盛與金色果實(隨季節更動)', '泡盛花花語:戀愛的來臨。<br>紅玫瑰花語：熱戀、熱情、熱愛、希望與你泛起激情的愛，真誠的愛、真心真意。'),
(105, '輕柔秋陽', 2800, '2020-05-04', 2, '4', 3, 'sunfw', '', '30×30×40cm', '庭園玫瑰、迷你橘玫瑰、復古康乃馨、粉桔梗', '康乃馨花語：熱情、魅力、使人柔弱的愛、真情。<br>橘玫瑰:羞怯、獻給你一份神祕的愛。<br>黃玫瑰花語：高貴、珍重祝福。<br>桔梗花的花語:真誠不變的愛。'),
(109, '甜蜜漫舞', 3000, '2020-02-10', 6, '2,5', 3, 'dance', '', '45×35×55cm', '粉玫、粉乒乓、白乒乓、白千鳥草、白雪柳', '粉玫瑰花語:初戀，特別的關懷，喜歡你那燦爛的微笑。<br>乒乓菊花語:圓滿。<br>千鳥草花語:輕盈、自由、正義、清凈。');

-- --------------------------------------------------------

--
-- 資料表結構 `style`
--

CREATE TABLE `style` (
  `sid` int(11) NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `style`
--

INSERT INTO `style` (`sid`, `name`) VALUES
(1, '畢業季'),
(2, '七夕情人節'),
(3, '冬季戀歌'),
(4, '春意盎然'),
(5, '夏日實驗');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `course`
--
ALTER TABLE `course`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `coursecate`
--
ALTER TABLE `coursecate`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `layout`
--
ALTER TABLE `layout`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `member`
--
ALTER TABLE `member`
  ADD PRIMARY KEY (`id`),
  ADD KEY `email` (`email`);

--
-- 資料表索引 `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `order_detail`
--
ALTER TABLE `order_detail`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`sid`);

--
-- 資料表索引 `style`
--
ALTER TABLE `style`
  ADD PRIMARY KEY (`sid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `categories`
--
ALTER TABLE `categories`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `course`
--
ALTER TABLE `course`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `layout`
--
ALTER TABLE `layout`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `member`
--
ALTER TABLE `member`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `orders`
--
ALTER TABLE `orders`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `order_detail`
--
ALTER TABLE `order_detail`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `product`
--
ALTER TABLE `product`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=110;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `style`
--
ALTER TABLE `style`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
